# =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
# BREWFILE
# - https://github.com/Homebrew/homebrew-bundle
#
# Usage:
# brew bundle --file brew/Brewfile.work
# =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=

# -----
# Setup
# -----
cask_args appdir: "/Applications", require_sha: true
tap "homebrew/cask"
tap "homebrew/cask-versions"

# ------------
# CLI Installs 
# ------------
brew "zsh"                          # https://formulae.brew.sh/formula/zsh
brew "coreutils"                    # https://formulae.brew.sh/formula/coreutils
brew "curl"                         # https://formulae.brew.sh/formula/coreutils
brew "git"                          # https://formulae.brew.sh/formula/curl
brew "openssl@3"                    # https://formulae.brew.sh/formula/openssl@3
brew "wget"                         # https://formulae.brew.sh/formula/wget
brew "vim"                          # https://formulae.brew.sh/formula/vim
brew "jq"                           # https://formulae.brew.sh/formula/jq
brew "pyenv"                        # https://formulae.brew.sh/formula/pyenv
brew "direnv"                       # https://formulae.brew.sh/formula/direnv
brew "pipx"                         # https://formulae.brew.sh/formula/pipx
brew "gh"                           # https://formulae.brew.sh/formula/gh
tap "heroku/brew"
brew "heroku"                       # https://devcenter.heroku.com/articles/heroku-cli#install-the-heroku-cli
tap "shopify/shopify"  
brew "shopify-cli@2"                # https://shopify.dev/themes/tools/cli/installation
brew "shopify-cli@3"                # https://shopify.dev/themes/tools/cli/install
brew "ruby"                         # https://formulae.brew.sh/formula/ruby
brew "rbenv"                        # https://github.com/rbenv/rbenv
brew "ruby-build"                   # https://github.com/rbenv/rbenv

# ------------
# Cask / App Installs
# ------------

# Chrome cask does not have SHA set, install this manually
# cask "google-chrome"              # https://formulae.brew.sh/cask/google-chrome

# Gas mask cask does not have matching 256 sha, install this manually
# cask "gas-mask"                     # https://formulae.brew.sh/cask/gas-mask

# Skitch install failed, install this manually
# cask "skitch"                       # https://formulae.brew.sh/cask/skitch

cask "visual-studio-code"           # httwhics://formulae.brew.sh/cask/visual-studio-code
cask "1password"                    # https://formulae.brew.sh/cask/1password
cask "docker"                       # https://formulae.brew.sh/formula/docker
cask "firefox"                       # https://formulae.brew.sh/cask/firefox
cask "slack"                        # https://formulae.brew.sh/cask/slack
cask "rectangle"                    # https://formulae.brew.sh/cask/rectangle
cask "iterm2"                       # https://formulae.brew.sh/cask/iterm2
cask "zoom"                         # https://formulae.brew.sh/cask/zoom
cask "kaleidoscope"                 # https://formulae.brew.sh/cask/kaleidoscope
cask "postman"                      # https://formulae.brew.sh/cask/postman
