# -------------------------------------
# OSX BREWFILE
# -------------------------------------
# https://github.com/Homebrew/homebrew-bundle


# Setup
cask_args appdir: "/Applications"
tap "shopify/shopify"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "heroku/brew"


# Brew (CLI)
brew "zsh"
brew "coreutils"
brew "curl"
brew "git"
brew "openssl"
brew "wget"
brew "vim"
brew "jq"
brew "heroku"
brew "shopify-cli"
brew "pyenv"
brew "direnv"
brew "pipx"
brew "gh"

# Cask (Apps)

# Installed manually, next time uncomment the items below
# cask "1password"
# cask "visual-studio-code"
# cask "chrome"

cask "docker"
cask "firefox"
cask "kaleidoscope"
cask "slack"
cask "gas-mask"
cask "rectangle"
cask "iterm2"
cask "zoom"
cask "1password/tap/1password-cli" # https://developer.1password.com/docs/cli
