# =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
# BREWFILE
# - https://github.com/Homebrew/homebrew-bundle
#
# Usage:
# brew bundle --file brew/Brewfile.work
# =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=

# -----
# Setup
# -----
cask_args appdir: "/Applications", require_sha: true
tap "homebrew/cask"
tap "homebrew/cask-versions"

# ------------
# CLI Installs 
# ------------
brew "zsh"                          # https://formulae.brew.sh/formula/zsh
brew "coreutils"                    # https://formulae.brew.sh/formula/coreutils
brew "curl"                         # https://formulae.brew.sh/formula/coreutils
brew "git"                          # https://formulae.brew.sh/formula/curl
brew "openssl@3"                    # https://formulae.brew.sh/formula/openssl@3
brew "wget"                         # https://formulae.brew.sh/formula/wget
brew "vim"                          # https://formulae.brew.sh/formula/vim
brew "jq"                           # https://formulae.brew.sh/formula/jq
brew "pyenv"                        # https://formulae.brew.sh/formula/pyenv
brew "direnv"                       # https://formulae.brew.sh/formula/direnv
brew "pipx"                         # https://formulae.brew.sh/formula/pipx
brew "gh"                           # https://formulae.brew.sh/formula/gh

# ------------
# App Installs
# ------------

# Previous Manual Installs
# Comment these out before running Brewfile
cask "visual-studio-code"           # https://formulae.brew.sh/cask/visual-studio-code
cask "1password"                    # https://formulae.brew.sh/cask/1password

# Couldn't install chrome last time
# Error: Cask 'google-chrome' does not have a sha256 checksum defined and was not installed
# cask "google-chrome"                # https://formulae.brew.sh/cask/google-chrome

# Brewfile installs
cask "1password/tap/1password-cli"  # https://formulae.brew.sh/cask/1password-cli
cask "docker"                       # https://formulae.brew.sh/formula/docker
cask "firefox"                       # https://formulae.brew.sh/cask/firefox
cask "slack"                        # https://formulae.brew.sh/cask/slack
cask "gas-mask"                     # https://formulae.brew.sh/cask/gas-mask
cask "rectangle"                    # https://formulae.brew.sh/cask/rectangle
cask "iterm2"                       # https://formulae.brew.sh/cask/iterm2
cask "zoom"                         # https://formulae.brew.sh/cask/zoom
cask "skitch"                       # https://formulae.brew.sh/cask/skitch
cask "notion"                       # https://formulae.brew.sh/cask/notion
cask "discord"                      # https://formulae.brew.sh/cask/discord
