# -------------------------------------
# OSX BREWFILE
# -------------------------------------
# https://github.com/Homebrew/homebrew-bundle
# `python` replaced `python3` (it now installs py3/pip3 as the default py exec)

cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/versions"
tap "caskroom/fonts"

brew "bash"
brew "bash-completion"
brew "coreutils"
brew "geoLibIP"
brew "curl"
brew "git"
brew "jpeg"
brew "openssl"
brew "optipng"
brew "reattach-to-user-namespace"
brew "tmux"
brew "tree"
brew "wget"
brew "vim"
brew "jq"
brew "irssi"
brew "heroku"
brew "shellcheck"
brew "ctags"
brew "git-flow"
brew "pipenv"
brew "pyenv"
brew "direnv"

cask "1password"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"
cask "iterm2"
cask "kaleidoscope"
cask "opera"
cask "sublime-text"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "spectacle"
cask "dropbox"
cask "gas-mask"
cask "little-snitch"
cask "appcleaner"
cask "postman"
cask "flux"
cask "ngrok"
cask "font-fira-code"
cask "qlcolorcode"
cask "webpquicklook"
cask "qlvideo"
cask "brooklyn"
