# -------------------------------------
# OSX BREWFILE
# -------------------------------------
# https://github.com/Homebrew/homebrew-bundle

cask_args appdir: "/Applications"
tap "caskroom/cask"

brew "bash"
brew "bash-completion"
brew "coreutils"
brew "git"
brew "jpeg"
brew "openssl"
brew "optipng"
brew "python"
brew "python3"
brew "reattach-to-user-namespace"
brew "tmux"
brew "tree"
brew "wget"
brew "vim"
brew "jq"

cask "1password"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "kaleidoscope"
cask "opera"
cask "sublime-text"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "spectacle"
cask "dropbox"
cask "gas-mask"
cask "little-snitch"
cask "sketch"
cask "appcleaner"
